Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: How do you apply a reconfiguration with low effort while guaranteeing correctness?
zh_cn: 如何在保证正确的同时以低成本应用新的配置？

source: How exactly the state is stored, accessed, and maintained is determined by a pluggable component
zh_cn: 至于状态具体的存储、访问和维护，则是由一个名为状态后端的可插拔组件来决定。

source: How exactly the state of a task is copied depends on the implementation of the state backend.
zh_cn: 因此任务的状态的具体拷贝过程完全取决于状态后端的实现。

source: How this operator works, including the role of the CheckpointCommitter, and which consistency guarantees it provides, is described in
zh_cn: 有关该算子的工作原理，包括CheckpointCommitter的作用以及送提供的一致性保障，我们会在209页"事务性数据汇连接器"一节详细介绍。

source: How‐ ever, too many co-located tasks can also overload a TaskManager and result in bad performance.
zh_cn: 然而，任务过于集中也会使TaskManager负载变高，继而导致性能下降。

source: However, Apache Flink has many features to significantly ease the maintenance of streaming applications.
zh_cn: 好在Flink自身提供的很多功能可以极大简化流式应用的维护。

source: However, Flink currently does not support changing the primitive (or structure) of a state.
zh_cn: 但是目前Flink还不支持改变状态的原语（或结构）。

source: However, ProcessWindowFunction’s Context object also offers unique features.
zh_cn: 而ProcessWindowFunction的Context对象还提供了一些特有的功能。

source: However, UNIX-based setups enjoy the richest tooling support because this environment is preferred by most Flink developers.
zh_cn: 但基于类UNIX系统的设置会享有最丰富的工具支持，因为大多数Flink开发人员都偏爱这类环境。

source: However, a function with keyed state can only access the state of a key if it received a record with that key.
zh_cn: 然而，具有键值分区状态的函数只有在收到某键值的记录时才能访问该键值的状态。

source: However, adding a single value to ListState—appending it to the end of the list—is a cheap operation because only the appended value is serialized.
zh_cn: 但向ListState中添加一个值（将其附加到列表最后）的操作会相对轻量级一些，因为它只会序列化新添加的值。

source: However, also with storage systems and execution engines of the Hadoop ecosystem the overall mode of operation of the infrastructure remains basically the same as the traditional data warehouse architec‐ ture, i.e., data is periodically extracted and loaded into to a data store and processed by periodic or ad-hoc queries in a batch fashion.
zh_cn: 虽说如此，但对Hadoop生态中的存储系统和执行引擎而言，其基础工作模式仍和传统数据仓库的架构保持一致，即周期性地将数据提取加载到数据存储系统，随后以批处理的方式执行定期或ad-hoc查询。

source: However, another implication is that the state of an application is never in a consis‐ tent state except for the logical points in time when a checkpoint is taken.
zh_cn: 但这也意味着除了生成检查点的几个逻辑时间点外，应用程序的状态无法做到强一致。

source: However, applications can freely choose the meaning of the time‐ stamps as long as the timestamps of the stream records are roughly ascending as the stream is advancing.
zh_cn: 但实际上应用可以自由选择时间戳的含义，只要保证流记录的时间戳会随着数据流的前进大致递增即可。

source: However, applications can freely choose the meaning of the timestamps as long as the timestamps of the stream records are roughly ascending as the stream is advancing.
zh_cn: 但实际上应用可以自由选择时间戳的含义，只要保证流记录的时间戳会随着数据流的前进大致递增即可。

source: However, as you start writing more advanced streaming applica‐ tions, you might find yourself needing to implement more complex windowing logic, such as windows that emit early results and update their results if late elements are encountered, or windows that start and end when specific records are received.
zh_cn: 然而，当你要着手实现一些高级的流式应用时，可能会发现自己需要完成更为复杂的窗口逻辑，例如：窗口需要提前发出结果并在之后遇到迟到元素时对结果进行更新，或者窗口需要以特定记录作为开始或结束的边界。

source: However, being able to reset the state of an application to a consistent point is not sufficient to achieve satisfying processing guarantees for an application.
zh_cn: 虽然如此，但像这样把应用状态重置到某个一致性的点所提供的应用处理保障还无法令人满意。

source: However, certain applications might not benefit from task chaining.
zh_cn: 然而，也有特定的应用可能无法从中受益。

source: However, counting how many times a specific event occurs in the input stream might return the wrong result under at-least-once guarantees.
zh_cn: 但如果要计算某个事件在输入流中出现的次数，至少一次保障可能就会返回错误的结果。

source: However, custom operators can have their own interpretation and may, for example, adjust the preci‐ sion to microseconds.
zh_cn: 但自定义算子可以有自己的时间戳解析机制，如将精度调整为微秒。

source: However, custom operators can have their own interpretation and, for example, adjust the precision to microseconds.
zh_cn: 但自定义算子可以有自己的解析机制，例如，将精度调整为微秒。

source: However, during busy times, customers will have to wait in line and latency will increase.
zh_cn: 然而，在高峰时段，顾客必须要排队，此时延迟将增加。

source: However, even with continuous ETL there will always be a certain delay until an event is processed by a query.
zh_cn: 但即便使用持续ETL，事件在被查询处理到之前总会有一定延迟。

source: However, even with continuous ETL there will always be a delay until an event is processed by a query.
zh_cn: 但即便持续地进行ETL操作，事件在被查询和处理到之前总会有一定延迟。

source: However, event-time applications require additional configuration com‐ pared to applications with processing-time semantics.
zh_cn: 但和基于处理时间语义的应用相比，基于事件时间的应用需要一些额外的配置。

source: However, event-time applications require some additional configuration compared to applications with processing-time semantics.
zh_cn: 但和基于处理时间语义的应用相比，基于事件时间的应用需要一些额外的配置。

source: However, guaranteeing exactly-once delivery of results to external systems is very challenging.
zh_cn: 至于保证将结果精确一次地传递到外部系统，则难度很大。

source: However, if the restarted application is not identical to the application from which the savepoint was taken, there are three cases to consider:
zh_cn: 然而，如果要重启的应用和之前生成保存点时的应用有所不同，那么就会有三种结果：

source: However, if you hardcoded the parallelism on the StreamExecutionEnvironment or
zh_cn: 但你如果是以硬编码的方式为StreamExecutionEnvironment或部分算子设置的并行度，

source: However, in certain situations, such as lambda functions or generic types, it is necessary to explicitly provide type information to make an application work or improve its performance.
zh_cn: 但在某些情况下，例如使用了Lambda函数或泛型类型，则必须显式指定类型信息才能启动应用或提高其性能。

source: However, in the context of Flink, the protocol is only run once for every
zh_cn: 但具体到Flink环境下，该协议只需针对每个检查点运行一次，

source: However, instead of checkpointing the state to the JobMa‐ nager’s volatile memory, FsStateBackend writes the state to a remote and persis‐ tent file system.
zh_cn: 但它不会在创建检查点时将状态存到JobManager的易失内存中，而是会将它们写入远程持久化文件系统。

source: However, it adds latency because results only become visible when a check‐ point completes.
zh_cn: 但它会增加一定延迟，因为结果只有在检查点完成后才对外可见。

source: However, it also increases the amount of data a job needs to reprocess after recovering from a failure before it catches up to the tail of the stream.
zh_cn: 但它同时会使作业在故障恢复过程中需要重新处理更多数据，才能"赶得上"流中的最新数据。

source: However, it can also be configured to provide at-least-once guarantees:
zh_cn: 你也可以将该保障调整为至少一次：

source: However, it cannot provide bulletproof exactly-once guarantees,2 adds to the state size of an application, and the sink system has to deal with a spiky writing pattern.
zh_cn: 然而，WAL数据汇无法100%提供精确一次保障，2 它还会导致应用状态大小增加以及接收系统需要处理一次次的"波峰式"写入。

source: However, it has a few notable drawbacks.
zh_cn: 然而自身却有很多明显的缺点。

source: However, it is possible to disable this safety check as described in “Running and Managing Streaming Appli‐
zh_cn: 但你可以禁用这一安全检查（相关内容会在第245页"运行和管理流式应用"中介绍）。

source: However, it is typically much smaller than keyed
zh_cn: 但它通常要比键值分区状态小得多。

source: However, it makes many applications much easier to realize, such as real-time dashboards or other monitoring applica‐ tions.
zh_cn: 反过来说，可查询式状态的确让很多应用变得容易实现，例如实时仪表盘或其他监控应用。

source: However, it relies on the fact that all partitions continuously provide increasing watermarks.
zh_cn: 然而，这依赖于一个事实——所有分区都会持续提供自增的水位线。

source: However, it requires Hadoop dependencies on the classpath in order to work.
zh_cn: 但为了让它工作，还必须在Classpath里加入Hadoop依赖，

source: However, it requires that all stateful operators of the initial version of an application specify two parameters to ensure the application can be properly maintained in the future.
zh_cn: 但它需要初始版本应用的全部状态化算子都指定好两个参数，才可以在未来正常工作。

source: However, it serves well for locally developing Flink applications.
zh_cn: 但它对于本地开发Flink应用而言是一个很好的选择。

source: However, it uses processing slots (see “Task Execution” on page 40 for a detailed discussion) to control the number of tasks that can be assigned to a worker process (TaskManager).
zh_cn: 但会采用处理槽（详细信息请参阅第40页"任务执行"一节）来控制可以分配给工作进程（TaskManager）的任务数。

source: However, it uses the more general AggregateFunction to aggregate values.
zh_cn: 但它使用了更加通用的AggregateFunction来聚合内部的值。

source: However, just being able to read or write data to external datastores is not sufficient for a stream processor that wants to provide meaningful consistency guarantees in the case of fail‐ ure.
zh_cn: 然而，对于流处理引擎而言，仅能读写外部数据存储是不够的，因为它还需要在故障时提供重要的一致性保障。

source: However, most real-world applications combine charac‐ teristics of more than one class which again shows the flexibility of this application design pattern.
zh_cn: 而现实中绝大多数应用都同时兼有多种类别模式的特征，这也印证了状态化流处理的灵活性。

source: However, once we reach a rate of incoming events such that the system resources are fully used, we will have to start buffering events.
zh_cn: 但现实中，一旦事件到达速率过高致使系统没有空闲资源，我们将被迫开始缓冲事件。

source: However, once we reach a rate of incoming events such that the sys‐ tem resources are fully used, we will have to start buffering events.
zh_cn: 但现实中，一旦事件到达速率过高致使系统没有空闲资源，系统就会被迫开始缓冲事件。

source: However, reading and writing data to disk and the over‐ head of de/serializing objects result in lower read and write performance com‐
zh_cn: 然而，对于磁盘的读写和序列化反序列化对象的开销使得它和在内存中维护状态比起来，读写性能会偏低。

source: However, reading state from remote storage during recovery is not very efficient.
zh_cn: 然而在恢复期间从远程存储读取状态效率并不高。

source: However, recovering from master failures requires additional configuration as dis‐ cussed before.
zh_cn: 但同样如前所述，主进程的故障恢复需要一些额外的配置。

source: However, some improvements such as higher throughput and better failure guarantees came at the cost of increasing processing latencies from milliseconds to seconds.
zh_cn: 但它们的部分改进（例如更高的吞吐和更完善的故障处理保障）是以增加处理延迟（从毫秒级到秒级）为代价的，

source: However, some operations must collect and buffer records to compute their result.
zh_cn: 然而，有些操作必须收集并缓冲记录才能计算结果，

source: However, sometimes the type extractor fails or you might want to define your
zh_cn: 但有时候类型提取器会失灵，

source: However, the Flink community is already working on unifying the two, and providing a single API for analysis of boun‐ ded and unbounded data streams in the same program is a priority in Flink’s future roadmap.
zh_cn: 但Flink社区正着力于将二者统一，并在未来规划中会优先提供一套API，使同一个程序能同时分析有界和无界的数据流。

source: However, the Kuber‐ netes project provides Minikube, an environment to run a single- node Kubernetes cluster locally on a single machine for testing or daily development.
zh_cn: 但它的项目内提供了一个可以在一台机器上本地运行单节点Kubernetes集群的环境——MiniKube，该环境可用于测试或日常开发。

source: However, the application might emit results twice because all results that have been emitted after the last successful checkpoint (the one to which the application falls back in the case of a recovery) will be emitted again.
zh_cn: 但由于在前一次成功的检查点（故障恢复时的回退位置）后发出的数据会被再次发送，所以应用可能会发出两次结果。

source: However, the applications for ReduceFunction are limited and usually restricted to simple aggregations since the input and output type must be the same.
zh_cn: 然而ReduceFunction的应用场景存在一定局限，由于输入、输出类型必须一致，所以通常仅限于一些简单的聚合。

source: However, the approach had a few notable drawbacks.
zh_cn: 但它有很多不足之处。

source: However, the broadcast state handle that is returned in the processElement()
zh_cn: 但processElement()方法返回的句柄对广播状态是只读的。

source: However, the complexity and consistency guarantees of an implementation depend on, among other things, the features and capabilities of the sink system.
zh_cn: 但具体实现的复杂度以及能够提供的一致性保障会取决于数据汇系统的特性及功能等因素。

source: However, the growing adoption of stream processing technology in the recent past has been driven to a large extent by the availability of mature open source stream processors.
zh_cn: 而近期流处理技术的普及在很大程度上还要归功于很多开源界成熟的流处理引擎。

source: However, the growing adoption of stream processing technology in the recent past is driven to a large extent by the availability of mature open source stream processors.
zh_cn: 然而近期流处理技术的普及还要归功于开源界很多成熟的流处理引擎。

source: However, the identifier of an operator is deterministically generated based on the identifiers of
zh_cn: 但该标识是根据前置算子的标识按照某种确定规则生成的，

source: However, the infrastructure remains basically the same as a traditional data ware‐ house architecture.
zh_cn: 然而，这些基础设施所用的架构只是和传统数据仓库大同小异。

source: However, the lifecycles of checkpoints and save‐ points differ.
zh_cn: 但他们的生命周期有所差异。

source: However, the reality is that we can never have perfect watermarks because that would mean we are always certain there are no delayed records.
zh_cn: 然而现实中永远不会有完美的水位线，因为总会存在迟到的记录。

source: However, the recommended approach is setting up and configuring a dedicated proxy service that controls access to the REST endpoint.
zh_cn: 但我们建议的方法是搭建和配置专用的代理服务来控制对于REST端点的访问。

source: However, the state of a window that
zh_cn: 但和执行增量聚合的窗口相比，

source: However, the vision of the Flink community is to treat batch processing as a special case of stream processing, i.e., the processing of bounded streams.
zh_cn: 但Flink社区的视角是把批处理看做流处理的一个特例，即处理有界的数据流。

source: However, the vision of the Flink community is to treat batch processing as a special case of stream processing—the processing of bounded streams.
zh_cn: 但Flink社区的视角是把批处理看做流处理的一个特例，即处理有界的数据流。

source: However, there are a few issues that need to be taken into account in order to be able to recompute and update results.
zh_cn: 如果想重新计算和更新结果，就必需考虑几个问题。

source: However, there are a few things to consider when debugging a Flink application in an IDE:
zh_cn: 但在调试时需要注意以下几点：

source: However, there are a few things to consider.
zh_cn: 虽然容易，但扩缩容过程中还是有一些需要考虑的问题。

source: However, there are constructors that take parameters to enable or disable asynchronous checkpointing
zh_cn: 但它有一些构造函数，

source: However, there is also a mode in which the call of the execute() method starts a Job‐ Manager and a TaskManager (by default with as many slots as available CPU threads) as separate threads within the same JVM. Consequently, the whole Flink application is multithreaded and executed within the same JVM process.
zh_cn: 但除此之外还有一种执行模式：当程序的execute()方法被调用时，会在同一个JVM中以独立线程的方式启动一个JobManager线程和一个TaskManager（默认的处理槽数等于CPU的线程数）。这样，整个Flink应用会以多线程的方式在同一个JVM进程中执行。

source: However, these files are not automatically cleaned up.
zh_cn: 但这些文件不会被自动清理。

source: However, these paths can also be
zh_cn: 但这些组件各自的路径也可以分别设置。

source: However, they do not measure the time it takes for records to be processed or the time that records wait in state until they are processed.
zh_cn: 然而，它们无法测量记录处理所需的时间或记录在状态中等待处理的时间。

source: However, they do not meet the latency requirements for many of today’s use cases.
zh_cn: 但这对于现如今很多用例场景而言无法满足延迟方面的需求。

source: However, they have a very similar feature set.
zh_cn: 但是它们的功能都很相似。

source: However, this has dramatically changed in the last decade.
zh_cn: 然而，这在过去十年里发生了巨大的变化，

source: However, to improve the efficiency of the necessary state transfer between tasks, Flink does not redistribute individual keys.
zh_cn: 但为了降低状态在不同任务之间迁移的必要成本，Flink不会对单独的键值实施再分配，

source: However, transactional data is often distributed across several disconnected database systems and becomes more valuable when it can be jointly analyzed.
zh_cn: 虽然如此，但事务数据通常存储于互不相连的数据库系统之中，如能将它们联结分析必能创造更大价值。

source: However, transactional data is often distributed across several discon‐ nected database systems and is more valuable when it can be jointly analyzed.
zh_cn: 然而用于存储事务性数据的多个数据库系统通常都是相互隔离的，如能将它们联合分析必然会创造更高的价值。

source: However, we have not yet discussed where they originate from.
zh_cn: 但一直没涉及它们的来源。

source: However, with the given configuration, Kubernetes does not export any port to external environments.
zh_cn: 然而使用上述给定的设置，Kubernetes不会向外部环境暴露任何端口。

source: However, with the growing popularity of Hadoop, companies realized that a lot of valuable data was excluded from their data analytics process.
zh_cn: 但随着Hadoop的流行，不少公司开始意识到他们现有的数据分析流程会遗漏很多有价值的数据。

source: However, you can also enable a feature called externalized checkpoints to retain checkpoints after the application has stopped.
zh_cn: 但你可以启用一个名为外化检查点（externalized checkpoint）的功能，在应用停止后保留检查点。

source: However, you can also invert the lookup order with the classloader.resolve-order configuration key.
zh_cn: 但你也可以使用classloader.resolve-order配置项反转这一顺序。

source: However, you can also provide default set‐ tings for a Flink cluster through Flink’s configuration file, which are applied if job- specific options are not declared.
zh_cn: 但你也可以通过Flink配置文件为整个Flink集群提供默认设置，它们会在作业未显式声明时起到作用。

source: However, you can be quite cer‐ tain all relevant data is available when you perform a computation.
zh_cn: 但这样的好处是在执行计算时你能确保全部相关数据都已收集完毕。

source: However, you can configure Docker to deploy its images to Mini‐ kube’s own registry by running the following command:
zh_cn: 为此，你可以使用以下命令配置Docker，让它将镜像部署到Minikube自己的注册表中：

source: However, you can configure the RocksDB state backend to also store the timers.
zh_cn: 同时你也可以配置RocksDB状态后端来存计时器。

source: However, you should also know how to create a new Flink project from scratch.
zh_cn: 但同时你也要掌握如何从头开始创建一个新的Flink项目。

source: However, you should be aware that failure scenarios exist in which a write-ahead log sink emits
zh_cn: 然而你要明白，WAL所支撑的数据汇在某些极端情况下可能会将记录写出多次。

source: How‐ ever, as of Flink 1.7 no such tool exists.
zh_cn: 但它们还没有在Flink 1.7版本中提供。

source: How‐ ever, efficient and reliable management of state is more challenging.
zh_cn: 而难点在于如何高效、可靠地管理状态。

source: How‐ ever, since it is typically not possible for an operator to retain all state forever, it needs to purge state at some point.
zh_cn: 然而通常算子无法永久保留所有状态，最终还是需要在某个时间点将其清除。

source: How‐ ever, too many colocated tasks can also overload a TaskManager and result in bad performance.
zh_cn: 然而，任务过于集中也会使TaskManager负载变高，继而可能导致性能下降。

source: IDs of Committed Files May Not Be Consecutive
zh_cn: 提交文件的ID不一定连续

source: IN specifies the type of the input records.
zh_cn: IN用于指定输入记录的类型。

source: Ideally, you would like this latency to remain constant and independent of the rate of the incoming events.
zh_cn: 理想情况下，你会希望延迟保持平稳，不受事件到来速率的影响。

source: Idempotent Sink Connectors
zh_cn: 幂等性数据汇连接器

source: Idempotent Writes
zh_cn: 幂等性写

source: Idempotent write operations are interesting for streaming applications because they can be performed multiple times without changing the results.
zh_cn: 幂等性写操作对于流式应用而言很有意义，因为它们可以在不改变结果的前提下多次执行。

source: If Java is not on the PATH or if you want to use a different Java version you can specify the root folder of a Java installation via the JAVA_HOME envi‐ ronment variable or the env.java.home key in the configuration file.
zh_cn: 如果PATH中没有配置Java或者想要使用其他Java版本，你可以利用配置文件中的JAVA_HOME环境变量或env.java.home键对应的参数来指定Java安装目录。

source: If a modified application is started from a savepoint, a state in the savepoint can only be mapped to the application if it contains an operator with a corresponding identi‐ fier and state name.
zh_cn: 如果应用在从保存点启动的时候发生过改动，那么保存点中的状态只有在应用还保留着那些含有对应标识和状态名称的算子时才可以成功映射。

source: If a savepoint path is provided, the application state is initialized from the savepoint.
zh_cn: 如果提供了保存点路径，会使用该保存点初始化应用状态。

source: If a source function (temporarily) does not emit anymore watermarks, it can declare itself idle.
zh_cn: 如果源函数（临时性地）不再发出水位线，可以把自己声明成空闲。

source: If a timestamp assigner is used, any existing timestamps and water‐ marks will be overwritten.
zh_cn: 一旦使用时间戳分配器，已有的时间戳和水位线都将被覆盖。

source: If a trigger is applied together with a MergingWindowAssigner, it needs to be able to handle the case when two windows are merged.
zh_cn: 如果某个触发器和MergingWindowAssigner一起使用，则需要处理两个窗口合并的情况。

source: If an application ingests data from a source connector that is not able to store and reset a reading position, it might suffer from data loss in the case of a failure and only provide at-most-once guarantees.
zh_cn: 如果应用使用的数据源连接器无法存储和重置读取位置，那么在出现故障时它就可能要丢失部分数据，从而只能提供最多一次保障。

source: If an application is updated without removing or changing existing state, it is always savepoint compatible and can be started from a savepoint of an earlier version.
zh_cn: 如果应用在更新时不会删除或改变已有状态，那么它一定是保存点兼容的，并且能够从旧版本的保存点启动。

source: If an application needs to recover from a failure, all processing-time timers that expired while the application was restarting will fire immediately when the application resumes.
zh_cn: 如果应用需要从故障中恢复，那么所有在应用重启过程中过期的处理时间计时器会在应用恢复后立即触发，

source: If both tasks are located on the same physical machine (which is often ensured by task schedu‐ lers), this exchange strategy avoids network communication.
zh_cn: 如果两端任务运行在同一物理机器上（通常由任务调度器保障），该交换策略可以避免网络通信。

source: If configured for HA, all Dispatchers of a standalone setup register at ZooKeeper.
zh_cn: 如果进行了HA配置，则所有独立集群设置下的Dispatcher都会在ZooKeeper中注册。

source: If events take a long time to travel in the data processing pipeline, we cannot easily ensure high throughput.
zh_cn: 如果事件在数据处理管道中传输时间太久，我们将难以确保高吞吐；

source: If events take long to travel in the data processing pipeline, we cannot easily ensure high throughput.
zh_cn: 如果事件在数据处理管道中的传输时间太久，我们将难以确保高吞吐；

source: If it fails after it has updated its
zh_cn: 如果在更新内部状态后发生故障，系统恢复后是否会重复更新？

source: If it fails after it has updated its internal state, will it update it again after it recovers?
zh_cn: 如果在更新内部状态后发生故障，系统恢复后是否会重复更新？

source: If it refers to a directory, FileInputFormat scans the directory for files to read.
zh_cn: 如果路径指向一个目录，则FileInputFormat会扫描并读取该目录中满足条件的文件。

source: If many or all checkpoints take longer than the checkpointing interval, this behavior might not be optimal for two reasons.
zh_cn: 如果很多或全部检查点的生成时间都长于生成间隔，那么可能需要对此进行调优，具体原因有二。

source: If multiple copies of the same job are run concurrently, metrics might become inaccurate, due to string conflicts.
zh_cn: 如果相同作业同时运行了多个副本，那么由于字符串冲突，度量标准可能会不准确。

source: If no BucketAssigner is explicitly specified, it uses a DateTimeBucketAssigner that assigns records to hourly buckets based on the pro‐
zh_cn: 如果没有显式指定BucketAssigner，数据汇将使用DateTimeBucketAssigner，按照记录写出时的处理时间将它们分到每小时一个的桶中。

source: If no CheckpointCommitter is configured, the information is written into a specific Cassandra table.
zh_cn: 如果该参数没有配置，数据汇会将相关信息写入一个特定的Cassandra表中。

source: If no port is configured, Cassandra’s default port 9042 is used.
zh_cn: 如果不指定端口，则它会使用Cassandra的默认端口9042。

source: If no such timer exists, the
zh_cn: 如果该计时器不存在，则方法不会有任何作用。

source: If not enough slots are available, Flink’s ResourceManager requests additional containers from the YARN Resource‐ Manager to start TaskManager processes, which register themselves at the Flink ResourceManager.
zh_cn: 如果处理槽数量不足，Flink的ResourceManager会向YARN的ResourceManager申请更多容器来启动TaskManager进程，这些进程在启动后会把自己注册到Flink的ResourceManager中。

source: If one of the TaskManagers fails, the number of available slots drops to six.
zh_cn: 如果有一个TaskManager出现故障，则可用处理槽的数量就降到了6个。

source: If started in session mode, Flink connects to YARN’s ResourceManager to start an application master that runs a Dispatcher thread and a Flink ResourceManager thread.
zh_cn: 如果在会话模式下启动，Flink会连接YARN的ResourceManager来启动包含一个Dispatcher线程和一个ResourceManager线程的ApplicationMaster。

source: If state gets lost during a failure, results will be incorrect after recovery.
zh_cn: 如果状态在故障期间丢失，那恢复后的结果就会不正确。

source: If that suc‐ ceeds, the tasks first try to load the checkpoint data from the local disk.
zh_cn: 如果成功，则任务会优先尝试从本地磁盘加载检查点数据。

source: If the JobManager runs remotely, the JobGraph must be shipped together with a JAR file that contains all classes and required dependencies of the application.
zh_cn: 如果是远程JobManager的情况，除了JobGraph之外，我们还要同时提供包含应用所需全部类和依赖的JAR包。

source: If the ResourceManager does not have enough slots to fulfill the JobManager’s request, the ResourceManager can talk to a resource provider to provision containers in which TaskManager processes are started.
zh_cn: 如果ResourceManager的处理槽数无法满足JobManager的请求，则ResourceManager可以和资源提供者通信，让它们提供额外容器来启动更多TaskManager进程。
